OpenFOAM-v2112/tutorials/basic/chtMultiRegionFoam/2DImplicitCyclic/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication ./Allmesh

# Run
runApplication $(getApplication)

#------------------------------------------------------------------------------
